; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet5 image1)
	(have_image Star6 spectrograph2)
	(have_image Star7 thermograph0)
	(have_image Planet8 image1)
	(have_image Star9 thermograph0)
	(have_image Planet10 image1)
	(have_image Phenomenon11 spectrograph2)
	(have_image Star12 image1)
	(have_image Planet13 thermograph0)
	(have_image Star14 spectrograph2)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 spectrograph2)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 planet13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet13)
   goals met: 0 of 14
5. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 14
7. (take_image satellite0 phenomenon16 instrument0 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 14
10. (turn_to satellite0 phenomenon11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 14
11. (take_image satellite0 phenomenon11 instrument0 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 14
12. (turn_to satellite0 star14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star14)
   goals met: 4 of 14
13. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 5 of 14
14. (turn_to satellite0 star6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star6)
   goals met: 5 of 14
15. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 6 of 14
16. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 6 of 14
17. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 7 of 14
18. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 7 of 14
19. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 14
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 14
21. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 8 of 14
22. (turn_to satellite0 star0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star0)
   goals met: 8 of 14
23. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 8 of 14
24. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   goals met: 8 of 14
25. (take_image satellite0 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 9 of 14
26. (turn_to satellite0 planet17 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet17)
   goals met: 9 of 14
27. (take_image satellite0 planet17 instrument1 image1)
   added: (have_image planet17 image1)
   goals met: 10 of 14
28. (turn_to satellite0 planet5 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet5)
   goals met: 10 of 14
29. (take_image satellite0 planet5 instrument1 image1)
   added: (have_image planet5 image1)
   goals met: 11 of 14
30. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 11 of 14
31. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 12 of 14
32. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 12 of 14
33. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 13 of 14
34. (turn_to satellite0 star3 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star3)
   goals met: 14 of 14
